examples/BESS2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


 vertices
 ( 
   (    0.000000   -1.219000    0.000000 )
   (    0.985000   -1.219000    0.000000 )
   (    1.204000   -1.219000    0.000000 )
   (    2.572000   -1.219000    0.000000 )
   (    2.982000   -1.219000    0.000000 )
   (    5.718000   -1.219000    0.000000 )
   (    6.128000   -1.219000    0.000000 )
   (    8.864000   -1.219000    0.000000 )
   (   12.192000   -1.219000    0.000000 )
   (    0.000000   -0.915000    0.000000 )
   (    0.985000   -0.915000    0.000000 )
   (    1.204000   -0.915000    0.000000 )
   (    2.572000   -0.915000    0.000000 )
   (    2.982000   -0.915000    0.000000 )
   (    5.718000   -0.915000    0.000000 )
   (    6.128000   -0.915000    0.000000 )
   (    8.864000   -0.915000    0.000000 )
   (   12.192000   -0.915000    0.000000 )
   (    0.000000   -0.190000    0.000000 )
   (    0.985000   -0.190000    0.000000 )
   (    1.204000   -0.190000    0.000000 )
   (    2.572000   -0.190000    0.000000 )
   (    2.982000   -0.190000    0.000000 )
   (    5.718000   -0.190000    0.000000 )
   (    6.128000   -0.190000    0.000000 )
   (    8.864000   -0.190000    0.000000 )
   (   12.192000   -0.190000    0.000000 )
   (    0.000000    0.190000    0.000000 )
   (    0.985000    0.190000    0.000000 )
   (    1.204000    0.190000    0.000000 )
   (    2.572000    0.190000    0.000000 )
   (    2.982000    0.190000    0.000000 )
   (    5.718000    0.190000    0.000000 )
   (    6.128000    0.190000    0.000000 )
   (    8.864000    0.190000    0.000000 )
   (   12.192000    0.190000    0.000000 )
   (    0.000000    0.915000    0.000000 )
   (    0.985000    0.915000    0.000000 )
   (    1.204000    0.915000    0.000000 )
   (    2.572000    0.915000    0.000000 )
   (    2.982000    0.915000    0.000000 )
   (    5.718000    0.915000    0.000000 )
   (    6.128000    0.915000    0.000000 )
   (    8.864000    0.915000    0.000000 )
   (   12.192000    0.915000    0.000000 )
   (    0.000000    1.219000    0.000000 )
   (    0.985000    1.219000    0.000000 )
   (    1.204000    1.219000    0.000000 )
   (    2.572000    1.219000    0.000000 )
   (    2.982000    1.219000    0.000000 )
   (    5.718000    1.219000    0.000000 )
   (    6.128000    1.219000    0.000000 )
   (    8.864000    1.219000    0.000000 )
   (   12.192000    1.219000    0.000000 )
   (    0.000000   -1.219000    2.052000 )
   (    0.985000   -1.219000    2.052000 )
   (    1.204000   -1.219000    2.052000 )
   (    2.572000   -1.219000    2.052000 )
   (    2.982000   -1.219000    2.052000 )
   (    5.718000   -1.219000    2.052000 )
   (    6.128000   -1.219000    2.052000 )
   (    8.864000   -1.219000    2.052000 )
   (   12.192000   -1.219000    2.052000 )
   (    0.000000   -0.915000    2.052000 )
   (    0.985000   -0.915000    2.052000 )
   (    1.204000   -0.915000    2.052000 )
   (    2.572000   -0.915000    2.052000 )
   (    2.982000   -0.915000    2.052000 )
   (    5.718000   -0.915000    2.052000 )
   (    6.128000   -0.915000    2.052000 )
   (    8.864000   -0.915000    2.052000 )
   (   12.192000   -0.915000    2.052000 )
   (    0.000000   -0.190000    2.052000 )
   (    0.985000   -0.190000    2.052000 )
   (    1.204000   -0.190000    2.052000 )
   (    2.572000   -0.190000    2.052000 )
   (    2.982000   -0.190000    2.052000 )
   (    5.718000   -0.190000    2.052000 )
   (    6.128000   -0.190000    2.052000 )
   (    8.864000   -0.190000    2.052000 )
   (   12.192000   -0.190000    2.052000 )
   (    0.000000    0.190000    2.052000 )
   (    0.985000    0.190000    2.052000 )
   (    1.204000    0.190000    2.052000 )
   (    2.572000    0.190000    2.052000 )
   (    2.982000    0.190000    2.052000 )
   (    5.718000    0.190000    2.052000 )
   (    6.128000    0.190000    2.052000 )
   (    8.864000    0.190000    2.052000 )
   (   12.192000    0.190000    2.052000 )
   (    0.000000    0.915000    2.052000 )
   (    0.985000    0.915000    2.052000 )
   (    1.204000    0.915000    2.052000 )
   (    2.572000    0.915000    2.052000 )
   (    2.982000    0.915000    2.052000 )
   (    5.718000    0.915000    2.052000 )
   (    6.128000    0.915000    2.052000 )
   (    8.864000    0.915000    2.052000 )
   (   12.192000    0.915000    2.052000 )
   (    0.000000    1.219000    2.052000 )
   (    0.985000    1.219000    2.052000 )
   (    1.204000    1.219000    2.052000 )
   (    2.572000    1.219000    2.052000 )
   (    2.982000    1.219000    2.052000 )
   (    5.718000    1.219000    2.052000 )
   (    6.128000    1.219000    2.052000 )
   (    8.864000    1.219000    2.052000 )
   (   12.192000    1.219000    2.052000 )
   (    0.000000   -1.219000    2.200000 )
   (    0.985000   -1.219000    2.200000 )
   (    1.204000   -1.219000    2.200000 )
   (    2.572000   -1.219000    2.200000 )
   (    2.982000   -1.219000    2.200000 )
   (    5.718000   -1.219000    2.200000 )
   (    6.128000   -1.219000    2.200000 )
   (    8.864000   -1.219000    2.200000 )
   (   12.192000   -1.219000    2.200000 )
   (    0.000000   -0.915000    2.200000 )
   (    0.985000   -0.915000    2.200000 )
   (    1.204000   -0.915000    2.200000 )
   (    2.572000   -0.915000    2.200000 )
   (    2.982000   -0.915000    2.200000 )
   (    5.718000   -0.915000    2.200000 )
   (    6.128000   -0.915000    2.200000 )
   (    8.864000   -0.915000    2.200000 )
   (   12.192000   -0.915000    2.200000 )
   (    0.000000   -0.190000    2.200000 )
   (    0.985000   -0.190000    2.200000 )
   (    1.204000   -0.190000    2.200000 )
   (    2.572000   -0.190000    2.200000 )
   (    2.982000   -0.190000    2.200000 )
   (    5.718000   -0.190000    2.200000 )
   (    6.128000   -0.190000    2.200000 )
   (    8.864000   -0.190000    2.200000 )
   (   12.192000   -0.190000    2.200000 )
   (    0.000000    0.190000    2.200000 )
   (    0.985000    0.190000    2.200000 )
   (    1.204000    0.190000    2.200000 )
   (    2.572000    0.190000    2.200000 )
   (    2.982000    0.190000    2.200000 )
   (    5.718000    0.190000    2.200000 )
   (    6.128000    0.190000    2.200000 )
   (    8.864000    0.190000    2.200000 )
   (   12.192000    0.190000    2.200000 )
   (    0.000000    0.915000    2.200000 )
   (    0.985000    0.915000    2.200000 )
   (    1.204000    0.915000    2.200000 )
   (    2.572000    0.915000    2.200000 )
   (    2.982000    0.915000    2.200000 )
   (    5.718000    0.915000    2.200000 )
   (    6.128000    0.915000    2.200000 )
   (    8.864000    0.915000    2.200000 )
   (   12.192000    0.915000    2.200000 )
   (    0.000000    1.219000    2.200000 )
   (    0.985000    1.219000    2.200000 )
   (    1.204000    1.219000    2.200000 )
   (    2.572000    1.219000    2.200000 )
   (    2.982000    1.219000    2.200000 )
   (    5.718000    1.219000    2.200000 )
   (    6.128000    1.219000    2.200000 )
   (    8.864000    1.219000    2.200000 )
   (   12.192000    1.219000    2.200000 )
   (    0.000000   -1.219000    2.896000 )
   (    0.985000   -1.219000    2.896000 )
   (    1.204000   -1.219000    2.896000 )
   (    2.572000   -1.219000    2.896000 )
   (    2.982000   -1.219000    2.896000 )
   (    5.718000   -1.219000    2.896000 )
   (    6.128000   -1.219000    2.896000 )
   (    8.864000   -1.219000    2.896000 )
   (   12.192000   -1.219000    2.896000 )
   (    0.000000   -0.915000    2.896000 )
   (    0.985000   -0.915000    2.896000 )
   (    1.204000   -0.915000    2.896000 )
   (    2.572000   -0.915000    2.896000 )
   (    2.982000   -0.915000    2.896000 )
   (    5.718000   -0.915000    2.896000 )
   (    6.128000   -0.915000    2.896000 )
   (    8.864000   -0.915000    2.896000 )
   (   12.192000   -0.915000    2.896000 )
   (    0.000000   -0.190000    2.896000 )
   (    0.985000   -0.190000    2.896000 )
   (    1.204000   -0.190000    2.896000 )
   (    2.572000   -0.190000    2.896000 )
   (    2.982000   -0.190000    2.896000 )
   (    5.718000   -0.190000    2.896000 )
   (    6.128000   -0.190000    2.896000 )
   (    8.864000   -0.190000    2.896000 )
   (   12.192000   -0.190000    2.896000 )
   (    0.000000    0.190000    2.896000 )
   (    0.985000    0.190000    2.896000 )
   (    1.204000    0.190000    2.896000 )
   (    2.572000    0.190000    2.896000 )
   (    2.982000    0.190000    2.896000 )
   (    5.718000    0.190000    2.896000 )
   (    6.128000    0.190000    2.896000 )
   (    8.864000    0.190000    2.896000 )
   (   12.192000    0.190000    2.896000 )
   (    0.000000    0.915000    2.896000 )
   (    0.985000    0.915000    2.896000 )
   (    1.204000    0.915000    2.896000 )
   (    2.572000    0.915000    2.896000 )
   (    2.982000    0.915000    2.896000 )
   (    5.718000    0.915000    2.896000 )
   (    6.128000    0.915000    2.896000 )
   (    8.864000    0.915000    2.896000 )
   (   12.192000    0.915000    2.896000 )
   (    0.000000    1.219000    2.896000 )
   (    0.985000    1.219000    2.896000 )
   (    1.204000    1.219000    2.896000 )
   (    2.572000    1.219000    2.896000 )
   (    2.982000    1.219000    2.896000 )
   (    5.718000    1.219000    2.896000 )
   (    6.128000    1.219000    2.896000 )
   (    8.864000    1.219000    2.896000 )
   (   12.192000    1.219000    2.896000 )
  );
 blocks
 ( 
 hex (   0   1  10   9  54  55  64  63) (  24   7  51) simpleGrading (1 1 1)
 hex (   1   2  11  10  55  56  65  64) (   5   7  51) simpleGrading (1 1 1)
 hex (   2   3  12  11  56  57  66  65) (  34   7  51) simpleGrading (1 1 1)
 hex (   3   4  13  12  57  58  67  66) (  10   7  51) simpleGrading (1 1 1)
 hex (   4   5  14  13  58  59  68  67) (  68   7  51) simpleGrading (1 1 1)
 hex (   5   6  15  14  59  60  69  68) (  10   7  51) simpleGrading (1 1 1)
 hex (   6   7  16  15  60  61  70  69) (  68   7  51) simpleGrading (1 1 1)
 hex (   7   8  17  16  61  62  71  70) (  83   7  51) simpleGrading (1 1 1)
 hex (  10  11  20  19  64  65  74  73) (   5  18  51) simpleGrading (1 1 1)
 hex (  12  13  22  21  66  67  76  75) (  10  18  51) simpleGrading (1 1 1)
 hex (  14  15  24  23  68  69  78  77) (  10  18  51) simpleGrading (1 1 1)
 hex (  16  17  26  25  70  71  80  79) (  83  18  51) simpleGrading (1 1 1)
 hex (  19  20  29  28  73  74  83  82) (   5   9  51) simpleGrading (1 1 1)
 hex (  20  21  30  29  74  75  84  83) (  34   9  51) simpleGrading (1 1 1)
 hex (  21  22  31  30  75  76  85  84) (  10   9  51) simpleGrading (1 1 1)
 hex (  22  23  32  31  76  77  86  85) (  68   9  51) simpleGrading (1 1 1)
 hex (  23  24  33  32  77  78  87  86) (  10   9  51) simpleGrading (1 1 1)
 hex (  24  25  34  33  78  79  88  87) (  68   9  51) simpleGrading (1 1 1)
 hex (  25  26  35  34  79  80  89  88) (  83   9  51) simpleGrading (1 1 1)
 hex (  28  29  38  37  82  83  92  91) (   5  18  51) simpleGrading (1 1 1)
 hex (  30  31  40  39  84  85  94  93) (  10  18  51) simpleGrading (1 1 1)
 hex (  32  33  42  41  86  87  96  95) (  10  18  51) simpleGrading (1 1 1)
 hex (  34  35  44  43  88  89  98  97) (  83  18  51) simpleGrading (1 1 1)
 hex (  36  37  46  45  90  91 100  99) (  24   7  51) simpleGrading (1 1 1)
 hex (  37  38  47  46  91  92 101 100) (   5   7  51) simpleGrading (1 1 1)
 hex (  38  39  48  47  92  93 102 101) (  34   7  51) simpleGrading (1 1 1)
 hex (  39  40  49  48  93  94 103 102) (  10   7  51) simpleGrading (1 1 1)
 hex (  40  41  50  49  94  95 104 103) (  68   7  51) simpleGrading (1 1 1)
 hex (  41  42  51  50  95  96 105 104) (  10   7  51) simpleGrading (1 1 1)
 hex (  42  43  52  51  96  97 106 105) (  68   7  51) simpleGrading (1 1 1)
 hex (  43  44  53  52  97  98 107 106) (  83   7  51) simpleGrading (1 1 1)
 hex (  54  55  64  63 108 109 118 117) (  24   7   3) simpleGrading (1 1 1)
 hex (  55  56  65  64 109 110 119 118) (   5   7   3) simpleGrading (1 1 1)
 hex (  56  57  66  65 110 111 120 119) (  34   7   3) simpleGrading (1 1 1)
 hex (  57  58  67  66 111 112 121 120) (  10   7   3) simpleGrading (1 1 1)
 hex (  58  59  68  67 112 113 122 121) (  68   7   3) simpleGrading (1 1 1)
 hex (  59  60  69  68 113 114 123 122) (  10   7   3) simpleGrading (1 1 1)
 hex (  60  61  70  69 114 115 124 123) (  68   7   3) simpleGrading (1 1 1)
 hex (  61  62  71  70 115 116 125 124) (  83   7   3) simpleGrading (1 1 1)
 hex (  63  64  73  72 117 118 127 126) (  24  18   3) simpleGrading (1 1 1)
 hex (  64  65  74  73 118 119 128 127) (   5  18   3) simpleGrading (1 1 1)
 hex (  66  67  76  75 120 121 130 129) (  10  18   3) simpleGrading (1 1 1)
 hex (  68  69  78  77 122 123 132 131) (  10  18   3) simpleGrading (1 1 1)
 hex (  70  71  80  79 124 125 134 133) (  83  18   3) simpleGrading (1 1 1)
 hex (  72  73  82  81 126 127 136 135) (  24   9   3) simpleGrading (1 1 1)
 hex (  73  74  83  82 127 128 137 136) (   5   9   3) simpleGrading (1 1 1)
 hex (  74  75  84  83 128 129 138 137) (  34   9   3) simpleGrading (1 1 1)
 hex (  75  76  85  84 129 130 139 138) (  10   9   3) simpleGrading (1 1 1)
 hex (  76  77  86  85 130 131 140 139) (  68   9   3) simpleGrading (1 1 1)
 hex (  77  78  87  86 131 132 141 140) (  10   9   3) simpleGrading (1 1 1)
 hex (  78  79  88  87 132 133 142 141) (  68   9   3) simpleGrading (1 1 1)
 hex (  79  80  89  88 133 134 143 142) (  83   9   3) simpleGrading (1 1 1)
 hex (  81  82  91  90 135 136 145 144) (  24  18   3) simpleGrading (1 1 1)
 hex (  82  83  92  91 136 137 146 145) (   5  18   3) simpleGrading (1 1 1)
 hex (  84  85  94  93 138 139 148 147) (  10  18   3) simpleGrading (1 1 1)
 hex (  86  87  96  95 140 141 150 149) (  10  18   3) simpleGrading (1 1 1)
 hex (  88  89  98  97 142 143 152 151) (  83  18   3) simpleGrading (1 1 1)
 hex (  90  91 100  99 144 145 154 153) (  24   7   3) simpleGrading (1 1 1)
 hex (  91  92 101 100 145 146 155 154) (   5   7   3) simpleGrading (1 1 1)
 hex (  92  93 102 101 146 147 156 155) (  34   7   3) simpleGrading (1 1 1)
 hex (  93  94 103 102 147 148 157 156) (  10   7   3) simpleGrading (1 1 1)
 hex (  94  95 104 103 148 149 158 157) (  68   7   3) simpleGrading (1 1 1)
 hex (  95  96 105 104 149 150 159 158) (  10   7   3) simpleGrading (1 1 1)
 hex (  96  97 106 105 150 151 160 159) (  68   7   3) simpleGrading (1 1 1)
 hex (  97  98 107 106 151 152 161 160) (  83   7   3) simpleGrading (1 1 1)
 hex ( 108 109 118 117 162 163 172 171) (  24   7  17) simpleGrading (1 1 1)
 hex ( 109 110 119 118 163 164 173 172) (   5   7  17) simpleGrading (1 1 1)
 hex ( 110 111 120 119 164 165 174 173) (  34   7  17) simpleGrading (1 1 1)
 hex ( 111 112 121 120 165 166 175 174) (  10   7  17) simpleGrading (1 1 1)
 hex ( 112 113 122 121 166 167 176 175) (  68   7  17) simpleGrading (1 1 1)
 hex ( 113 114 123 122 167 168 177 176) (  10   7  17) simpleGrading (1 1 1)
 hex ( 114 115 124 123 168 169 178 177) (  68   7  17) simpleGrading (1 1 1)
 hex ( 115 116 125 124 169 170 179 178) (  83   7  17) simpleGrading (1 1 1)
 hex ( 117 118 127 126 171 172 181 180) (  24  18  17) simpleGrading (1 1 1)
 hex ( 118 119 128 127 172 173 182 181) (   5  18  17) simpleGrading (1 1 1)
 hex ( 119 120 129 128 173 174 183 182) (  34  18  17) simpleGrading (1 1 1)
 hex ( 120 121 130 129 174 175 184 183) (  10  18  17) simpleGrading (1 1 1)
 hex ( 121 122 131 130 175 176 185 184) (  68  18  17) simpleGrading (1 1 1)
 hex ( 122 123 132 131 176 177 186 185) (  10  18  17) simpleGrading (1 1 1)
 hex ( 123 124 133 132 177 178 187 186) (  68  18  17) simpleGrading (1 1 1)
 hex ( 124 125 134 133 178 179 188 187) (  83  18  17) simpleGrading (1 1 1)
 hex ( 126 127 136 135 180 181 190 189) (  24   9  17) simpleGrading (1 1 1)
 hex ( 127 128 137 136 181 182 191 190) (   5   9  17) simpleGrading (1 1 1)
 hex ( 128 129 138 137 182 183 192 191) (  34   9  17) simpleGrading (1 1 1)
 hex ( 129 130 139 138 183 184 193 192) (  10   9  17) simpleGrading (1 1 1)
 hex ( 130 131 140 139 184 185 194 193) (  68   9  17) simpleGrading (1 1 1)
 hex ( 131 132 141 140 185 186 195 194) (  10   9  17) simpleGrading (1 1 1)
 hex ( 132 133 142 141 186 187 196 195) (  68   9  17) simpleGrading (1 1 1)
 hex ( 133 134 143 142 187 188 197 196) (  83   9  17) simpleGrading (1 1 1)
 hex ( 135 136 145 144 189 190 199 198) (  24  18  17) simpleGrading (1 1 1)
 hex ( 136 137 146 145 190 191 200 199) (   5  18  17) simpleGrading (1 1 1)
 hex ( 137 138 147 146 191 192 201 200) (  34  18  17) simpleGrading (1 1 1)
 hex ( 138 139 148 147 192 193 202 201) (  10  18  17) simpleGrading (1 1 1)
 hex ( 139 140 149 148 193 194 203 202) (  68  18  17) simpleGrading (1 1 1)
 hex ( 140 141 150 149 194 195 204 203) (  10  18  17) simpleGrading (1 1 1)
 hex ( 141 142 151 150 195 196 205 204) (  68  18  17) simpleGrading (1 1 1)
 hex ( 142 143 152 151 196 197 206 205) (  83  18  17) simpleGrading (1 1 1)
 hex ( 144 145 154 153 198 199 208 207) (  24   7  17) simpleGrading (1 1 1)
 hex ( 145 146 155 154 199 200 209 208) (   5   7  17) simpleGrading (1 1 1)
 hex ( 146 147 156 155 200 201 210 209) (  34   7  17) simpleGrading (1 1 1)
 hex ( 147 148 157 156 201 202 211 210) (  10   7  17) simpleGrading (1 1 1)
 hex ( 148 149 158 157 202 203 212 211) (  68   7  17) simpleGrading (1 1 1)
 hex ( 149 150 159 158 203 204 213 212) (  10   7  17) simpleGrading (1 1 1)
 hex ( 150 151 160 159 204 205 214 213) (  68   7  17) simpleGrading (1 1 1)
 hex ( 151 152 161 160 205 206 215 214) (  83   7  17) simpleGrading (1 1 1)
  );
defaultPatch
{
    name default; // optional
    type patch;
}

 boundary
 ( 
 northbc 
   {   
      type patch;   
       faces        
       (            
     (  45  99 100  46)
     (  99 153 154 100)
     ( 153 207 208 154)
     (  46 100 101  47)
     ( 100 154 155 101)
     ( 154 208 209 155)
     (  47 101 102  48)
     ( 101 155 156 102)
     ( 155 209 210 156)
     (  48 102 103  49)
     ( 102 156 157 103)
     ( 156 210 211 157)
     (  49 103 104  50)
     ( 103 157 158 104)
     ( 157 211 212 158)
     (  50 104 105  51)
     ( 104 158 159 105)
     ( 158 212 213 159)
     (  51 105 106  52)
     ( 105 159 160 106)
     ( 159 213 214 160)
     (  52 106 107  53)
     ( 106 160 161 107)
     ( 160 214 215 161)
       );            
   }   
 eastbc  
   {   
      type patch;   
       faces        
       (            
     (   8  17  71  62)
     (  62  71 125 116)
     ( 116 125 179 170)
     (  17  26  80  71)
     (  71  80 134 125)
     ( 125 134 188 179)
     (  26  35  89  80)
     (  80  89 143 134)
     ( 134 143 197 188)
     (  35  44  98  89)
     (  89  98 152 143)
     ( 143 152 206 197)
     (  44  53 107  98)
     (  98 107 161 152)
     ( 152 161 215 206)
       );            
   }   
 southbc 
   {   
      type patch;   
       faces        
       (            
     (   0   1  55  54)
     (  54  55 109 108)
     ( 108 109 163 162)
     (   1   2  56  55)
     (  55  56 110 109)
     ( 109 110 164 163)
     (   2   3  57  56)
     (  56  57 111 110)
     ( 110 111 165 164)
     (   3   4  58  57)
     (  57  58 112 111)
     ( 111 112 166 165)
     (   4   5  59  58)
     (  58  59 113 112)
     ( 112 113 167 166)
     (   5   6  60  59)
     (  59  60 114 113)
     ( 113 114 168 167)
     (   6   7  61  60)
     (  60  61 115 114)
     ( 114 115 169 168)
     (   7   8  62  61)
     (  61  62 116 115)
     ( 115 116 170 169)
       );            
   }   
 westbc  
   {   
      type patch;   
       faces        
       (            
     (   0  54  63   9)
     (  54 108 117  63)
     ( 108 162 171 117)
     (  63 117 126  72)
     ( 117 171 180 126)
     (  72 126 135  81)
     ( 126 180 189 135)
     (  81 135 144  90)
     ( 135 189 198 144)
     (  36  90  99  45)
     (  90 144 153  99)
     ( 144 198 207 153)
       );            
   }   
 topbc   
   {   
      type patch;   
       faces        
       (            
     ( 162 163 172 171)
     ( 171 172 181 180)
     ( 180 181 190 189)
     ( 189 190 199 198)
     ( 198 199 208 207)
     ( 163 164 173 172)
     ( 172 173 182 181)
     ( 181 182 191 190)
     ( 190 191 200 199)
     ( 199 200 209 208)
     ( 164 165 174 173)
     ( 173 174 183 182)
     ( 182 183 192 191)
     ( 191 192 201 200)
     ( 200 201 210 209)
     ( 165 166 175 174)
     ( 174 175 184 183)
     ( 183 184 193 192)
     ( 192 193 202 201)
     ( 201 202 211 210)
     ( 166 167 176 175)
     ( 175 176 185 184)
     ( 184 185 194 193)
     ( 193 194 203 202)
     ( 202 203 212 211)
     ( 167 168 177 176)
     ( 176 177 186 185)
     ( 185 186 195 194)
     ( 194 195 204 203)
     ( 203 204 213 212)
     ( 168 169 178 177)
     ( 177 178 187 186)
     ( 186 187 196 195)
     ( 195 196 205 204)
     ( 204 205 214 213)
     ( 169 170 179 178)
     ( 178 179 188 187)
     ( 187 188 197 196)
     ( 196 197 206 205)
     ( 205 206 215 214)
       );            
   }   
 bottombc
   {   
      type patch;   
       faces        
       (            
     (   0   9  10   1)
     (  36  45  46  37)
     (   1  10  11   2)
     (  10  19  20  11)
     (  19  28  29  20)
     (  28  37  38  29)
     (  37  46  47  38)
     (   2  11  12   3)
     (  20  29  30  21)
     (  38  47  48  39)
     (   3  12  13   4)
     (  12  21  22  13)
     (  21  30  31  22)
     (  30  39  40  31)
     (  39  48  49  40)
     (   4  13  14   5)
     (  22  31  32  23)
     (  40  49  50  41)
     (   5  14  15   6)
     (  14  23  24  15)
     (  23  32  33  24)
     (  32  41  42  33)
     (  41  50  51  42)
     (   6  15  16   7)
     (  24  33  34  25)
     (  42  51  52  43)
     (   7  16  17   8)
     (  16  25  26  17)
     (  25  34  35  26)
     (  34  43  44  35)
     (  43  52  53  44)
       );            
   }   
 inner
   {   
      type patch;   
       faces        
       (            
     (  20  74  75  21)
     (  22  76  77  23)
     (  24  78  79  25)
     (  36  90  91  37)
     (  38  92  93  39)
     (  40  94  95  41)
     (  42  96  97  43)
     (  74 128 129  75)
     (  76 130 131  77)
     (  78 132 133  79)
     (  92 146 147  93)
     (  94 148 149  95)
     (  96 150 151  97)
     (  14  23  77  68)
     (  16  25  79  70)
     (  30  39  93  84)
     (  32  41  95  86)
     (  34  43  97  88)
     (  66  75 129 120)
     (  68  77 131 122)
     (  70  79 133 124)
     (  84  93 147 138)
     (  86  95 149 140)
     (  88  97 151 142)
     (   9  10  64  63)
     (  11  12  66  65)
     (  13  14  68  67)
     (  15  16  70  69)
     (  29  30  84  83)
     (  31  32  86  85)
     (  33  34  88  87)
     (  65  66 120 119)
     (  67  68 122 121)
     (  69  70 124 123)
     (  83  84 138 137)
     (  85  86 140 139)
     (  87  88 142 141)
     (  11  65  74  20)
     (  13  67  76  22)
     (  15  69  78  24)
     (  29  83  92  38)
     (  31  85  94  40)
     (  33  87  96  42)
     (  65 119 128  74)
     (  67 121 130  76)
     (  69 123 132  78)
     (  83 137 146  92)
     (  85 139 148  94)
     (  87 141 150  96)
     (  63  64  73  72)
     (  72  73  82  81)
     (  81  82  91  90)
     ( 119 120 129 128)
     ( 121 122 131 130)
     ( 123 124 133 132)
     ( 137 138 147 146)
     ( 139 140 149 148)
     ( 141 142 151 150)
       );            
   }   
 );
