examples/BESS2/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
(
    {
        // Name of new patch
        name inlet;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set f0;
    }

   {
        // Name of new patch
        name return1;

        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = set : name of faceSet
        set f1;
   }
   {
       // Name of new patch
       name return2;

       // Dictionary to construct new patch from
      patchInfo
      {
        type patch;
      }

      // How to construct: either from 'patches' or 'set'
      constructFrom set;

      // If constructFrom = set : name of faceSet
      set f2;
   }

   {
    // Name of new patch
    name backrack1;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack1;
   }
   {
    // Name of new patch
    name backrack2;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack2;
   }
   {
    // Name of new patch
    name backrack3;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack3;
   }

   {
    // Name of new patch
    name backrack4;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack4;
   }
   {
    // Name of new patch
    name backrack5;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack5;
   }
   {
    // Name of new patch
    name backrack6;

    // Dictionary to construct new patch from
   patchInfo
    {
    type patch;
    }

   // How to construct: either from 'patches' or 'set'
   constructFrom set;

   // If constructFrom = set : name of faceSet
   set rack6;
   }
   {
   // Name of new patch
   name hotbattery;

   // Dictionary to construct new patch from
  patchInfo
   {
   type patch;
   }

  // How to construct: either from 'patches' or 'set'
  constructFrom set;

  // If constructFrom = set : name of faceSet
  set faulty;
  }
 


);

// ************************************************************************* //
