examples/BESS2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            noSlip;
    }

    inner
    {
        type            noSlip;
    }

    default
    {
        type            noSlip;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (9.5 0.0 0.0);
    }

    return1
    {
        type            fixedValue;
        value           uniform (0.0 4.5 0.0);  // bot +
    }

    return2
    {
        type            fixedValue; 
        value           uniform (0.0 -4.5 0.0); // top -
    }

    "(backrack1|backrack2|backrack3)"
    {
      //  type            fixedValue;
      //  value           uniform (0.0 0.01 0.0);  // bot +
       type            noSlip;
    }

    "(backrack4|backrack5|backrack6)"
    {
      //  type            fixedValue;
      //  value           uniform (0.0 -0.01 0.0);  // top -
        type            noSlip;
    }

    hotbattery
    {
      //  type            fixedValue;
      //  value           uniform (0.0 0.01 0.0);  // top -
        type            noSlip;
    }
    
}


// ************************************************************************* //
