examples/BESS2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            calculated;
        value           $internalField;
      //  type         zeroGradient;
    }

    inner
    {
        type            calculated;
        value           $internalField;
      //  type         zeroGradient;
    }

    default
    {
        type            calculated;
        value           $internalField;
     //   type         zeroGradient;
    }
    

    "(inlet|return1|return2)"
    {
        type            calculated;
        value           $internalField;        
    }

   "(backrack1|backrack2|backrack3|backrack4|backrack5|backrack6)"
    {
        //type            zeroGradient;
        type            calculated;
        value           $internalField;        
    }

    hotbattery
    {
        //type            zeroGradient;
        type            calculated;
        value           $internalField; 
    } 
}


// ************************************************************************* //
