examples/BESS2/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302.15;

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            zeroGradient;
    }

    inner
    {
        type            zeroGradient;
    }

    default
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 302.15;
    }

    "(return1|return2)"
    {        
        type            zeroGradient;
    }

   "(backrack1|backrack2|backrack3|backrack4|backrack5|backrack6)"
    {
        type            fixedValue;
        value           uniform 308.15;
       // type            zeroGradient;
    }

    hotbattery
    {
        type            fixedValue;
        value           uniform 323.15;
       // type            zeroGradient;
    }



}


// ************************************************************************* //
