examples/BESS2/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
       type            zeroGradient;
    }

    inner
    {
        type            zeroGradient;
    }
    
    default
    {
        type            zeroGradient;
    }

   "(inlet|return1|return2)"
    {
        type            zeroGradient;
    }

    "(backrack1|backrack2|backrack3|backrack4|backrack5|backrack6)"
    {
        type            zeroGradient;
    }

    hotbattery
    {
      //  type            zeroGradient;
        type            fixedValue;
        value           uniform 0.0;
    } 
}


// ************************************************************************* //
