examples/BESS2/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{

    "(northbc|southbc|eastbc|westbc|topbc|bottombc)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    default
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(inlet|return1|return2)"
    {
       // type            fixedFluxPressure;
       // value           $internalField;
        type         zeroGradient;
    }

    "(backrack1|backrack2|backrack3|backrack4|backrack5|backrack6)"
    {
        type            fixedFluxPressure;
        value           $internalField;
       //type            zeroGradient;
    }

    hotbattery
    {
        type            fixedFluxPressure;
        value           $internalField;
       //type            zeroGradient;
    }
}


// ************************************************************************* //
