examples/BESS2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.982 -0.15 1.0)(0.988 0.15 1.3);
    }
    {
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.4 -0.92 0.3)(0.8 -0.90 0.7);
    } 
    {
        name    f2;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.4  0.90 0.3)(0.8 0.92 0.7);
    } 

    {
        name    rack1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (1.24  -0.192 0.1)(2.56 -0.188 2.08);
    } 

    {
        name    rack2;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (3.02  -0.192 0.1)(5.70 -0.188 2.08);    
    } 

    {
        name    rack3;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (6.18  -0.192 0.1)(8.80 -0.188 2.08);    
    }
    
    {
        name    rack4;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (1.24  0.188 0.1)(2.56 0.192 2.08);
    } 

    {
        name    rack5;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (3.02  0.188 0.1)(5.70 0.192 2.08);    
    } 

    {
        name    rack6;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (6.18  0.188 0.1)(8.80 0.192 2.08);    
    }

    {
        name    faulty;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (3.914 -0.192 1.25)(4.364 -0.188 1.480);    
    } 



);

// ************************************************************************* //
